# -*- coding: utf-8 -*-

import os.path
import sys
import textwrap

import pytest

from src.csvdiff2 import csvdiff


TEST_DATA_DIR = 'data/e2e_04_file_encoding'

@pytest.mark.skipif(True, reason="[Because I don't know how to handle unicode in python2.]")
def test_file_encoding_utf8(path_to_tests_dir, capfd):

    lhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'left_UTF-8.csv')
    rhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'right_UTF-8.csv')

    sys.argv = ['csvdiff.py', lhs_csv, rhs_csv, '-ac']
    csvdiff.main()

    out, err = capfd.readouterr()
    assert err == ''
    assert out == textwrap.dedent('''
        ============ Report ============

        * All
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        left_UTF-8.csv                                                                                                 right_UTF-8.csv                                                                                               Column indices with difference
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        2 ['1', '値１−１', '１００１', '東京', 'ウナ・セラ・ディ東京']                                              !  2 ['1', '値１−１', '１００１', '東京', 'ウナ・セラ・デイ東京']                                              @ [4]
        3 ['2', '値１−２', '１００２', '大阪', '西長堀アパート']                                                       3 ['2', '値１−２', '１００２', '大阪', '西長堀アパート']                                                  
        4 ['3', '値１−３', '１００３', '横浜', '伊勢佐木町ブルースでも歌って']                                      !  4 ['3', '値１−３', '１００３', '横浜', '伊勢佐木町ブルーズでも歌って']                                      @ [4]
        5 ['4', '値i−４', '１００４', '北海道', '羊蹄山の麓🌱']                                                     !  5 ['4', '値１−４', '１００４', '北海道', '羊蹄山の麓🌱']                                                    @ [1]
        6 ['5', '値１−５', '１００５', '三重', '三重県伊賀市忍者村']                                                !  6 ['5', '値１−５', '１ｏ０５', '二重', '三重県伊賀市忍者村']                                                @ [2, 3]
        7 ['6', '値１−６', '１００６', '新潟', '星峠の棚田🌙']                                                      !  7 ['6', '値１−６', '１００６', '新烏', '星峠の棚田🌟']                                                      @ [3, 4]
        8 ['7', '値１−７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']     8 ['7', '値１−７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']
        
        * Count & Row number
        same lines           : 2
        left side only    (<): 0 :-- Row Numbers      -->: []
        right side only   (>): 0 :-- Row Numbers      -->: []
        with differences  (!): 5 :-- Row Number Pairs -->: [(2, 2), (4, 4), (5, 5), (6, 6), (7, 7)]
    ''')


@pytest.mark.skipif(True, reason="[Because I don't know how to handle unicode in python2.]")
def test_file_encoding_shift_jis(path_to_tests_dir, capfd):

    lhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'left_Shift_JIS.csv')
    rhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'right_Shift_JIS.csv')

    sys.argv = ['csvdiff.py', lhs_csv, rhs_csv, '-ac', '-e Shift_JIS']
    csvdiff.main()

    out, err = capfd.readouterr()
    assert err == ''
    assert out == textwrap.dedent('''
        ============ Report ============

        * All
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        left_Shift_JIS.csv                                                                                             right_Shift_JIS.csv                                                                                           Column indices with difference
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        2 ['1', '値１-１', '１００１', '東京', 'ウナ・セラ・ディ東京']                                              !  2 ['1', '値１-１', '１００１', '東京', 'ウナ・セラ・デイ東京']                                              @ [4]
        3 ['2', '値１-２', '１００２', '大阪', '西長堀アパート']                                                       3 ['2', '値１-２', '１００２', '大阪', '西長堀アパート']                                                  
        4 ['3', '値１-３', '１００３', '横浜', '伊勢佐木町ブルースでも歌って']                                      !  4 ['3', '値１-３', '１００３', '横浜', '伊勢佐木町ブルーズでも歌って']                                      @ [4]
        5 ['4', '値i-４', '１００４', '北海道', '羊蹄山の麓']                                                       !  5 ['4', '値１-４', '１００４', '北海道', '羊蹄山の麓']                                                      @ [1]
        6 ['5', '値１-５', '１００５', '三重', '三重県伊賀市忍者村']                                                !  6 ['5', '値１-５', '１ｏ０５', '二重', '三重県伊賀市忍者村']                                                @ [2, 3]
        7 ['6', '値１-６', '１００６', '新潟', '星峠の棚田']                                                        !  7 ['6', '値１-６', '１００６', '新烏', '星峠の棚田']                                                        @ [3]
        8 ['7', '値１-７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']     8 ['7', '値１-７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']
        
        * Count & Row number
        same lines           : 2
        left side only    (<): 0 :-- Row Numbers      -->: []
        right side only   (>): 0 :-- Row Numbers      -->: []
        with differences  (!): 5 :-- Row Number Pairs -->: [(2, 2), (4, 4), (5, 5), (6, 6), (7, 7)]
    ''')


@pytest.mark.skipif(True, reason="[Because I don't know how to handle unicode in python2.]")
def test_file_encoding_euc_jp(path_to_tests_dir, capfd):

    lhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'left_EUC-JP.csv')
    rhs_csv = os.path.join(path_to_tests_dir, TEST_DATA_DIR, 'right_EUC-JP.csv')

    sys.argv = ['csvdiff.py', lhs_csv, rhs_csv, '-ac', '-e EUC-JP']
    csvdiff.main()

    out, err = capfd.readouterr()
    assert err == ''
    assert out == textwrap.dedent('''
        ============ Report ============

        * All
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        left_EUC-JP.csv                                                                                                right_EUC-JP.csv                                                                                              Column indices with difference
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        2 ['1', '値１-１', '１００１', '東京', 'ウナ・セラ・ディ東京']                                              !  2 ['1', '値１-１', '１００１', '東京', 'ウナ・セラ・デイ東京']                                              @ [4]
        3 ['2', '値１-２', '１００２', '大阪', '西長堀アパート']                                                       3 ['2', '値１-２', '１００２', '大阪', '西長堀アパート']                                                  
        4 ['3', '値１-３', '１００３', '横浜', '伊勢佐木町ブルースでも歌って']                                      !  4 ['3', '値１-３', '１００３', '横浜', '伊勢佐木町ブルーズでも歌って']                                      @ [4]
        5 ['4', '値i-４', '１００４', '北海道', '羊蹄山の麓']                                                       !  5 ['4', '値１-４', '１００４', '北海道', '羊蹄山の麓']                                                      @ [1]
        6 ['5', '値１-５', '１００５', '三重', '三重県伊賀市忍者村']                                                !  6 ['5', '値１-５', '１ｏ０５', '二重', '三重県伊賀市忍者村']                                                @ [2, 3]
        7 ['6', '値１-６', '１００６', '新潟', '星峠の棚田']                                                        !  7 ['6', '値１-６', '１００６', '新烏', '星峠の棚田']                                                        @ [3]
        8 ['7', '値１-７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']     8 ['7', '値１-７', '１００７', '京都', '京都府京都市上京区今出川通烏丸東入上る二筋目東入下る相国寺門前町']

        * Count & Row number
        same lines           : 2
        left side only    (<): 0 :-- Row Numbers      -->: []
        right side only   (>): 0 :-- Row Numbers      -->: []
        with differences  (!): 5 :-- Row Number Pairs -->: [(2, 2), (4, 4), (5, 5), (6, 6), (7, 7)]
    ''')



